Repository: Kishan2123/FarmAura_application
Catalog: lib/l10n/app_*.arb
Languages: hi, hi_kh, kn

# sectionCropRotation
source: Crop rotation
hi_kh: फसल चक्र
kn: ಬೆಳೆ ಪರಿಭ್ರಮಣೆ

source: Last crop grown
hi_kh: पिछला फसल
kn: ಕೊನೆಯದಾಗಿ ಬೆಳೆದ ಬೆಳೆ

source: Enter last crop
hi_kh: पिछला फसल भरें
kn: ಕೊನೆಯ ಬೆಳೆಯನ್ನು ನಮೂದಿಸಿ

source: Frequent crop
hi_kh: अक्सर होवे वाला
kn: ಆಗಾಗ್ಗೆ ಬೆಳೆಯುವ ಬೆಳೆ

source: Enter frequent crop
hi_kh: फसल भरें
kn: ಆಗಾಗ್ಗೆ ಬೆಳೆಯುವ ಬೆಳೆಯನ್ನು ನಮೂದಿಸಿ

source: Add fertilizer
hi_kh: खाद जोड़ें
kn: ಗೊಬ್ಬರ ಸೇರಿಸಿ

source: Get recommendation
hi_kh: सलाह लें
kn: ಶಿಫಾರಸು ಪಡೆಯಿರಿ

source: Fill all fields
hi_kh: सब भरें
kn: ಎಲ್ಲಾ ಕ್ಷೇತ್ರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ

source: Fertilizer details
hi_kh: खाद विवरण
kn: ಗೊಬ್ಬರ ವಿವರಗಳು

source: Select fertilizer
hi_kh: खाद चुनें
kn: ಗೊಬ್ಬರವನ್ನು ಆಯ್ಕೆಮಾಡಿ

source: Enter fertilizer name
hi_kh: नाम भरें
kn: ಗೊಬ್ಬರದ ಹೆಸರನ್ನು ನಮೂದಿಸಿ

source: Quantity
hi_kh: मात्रा
kn: ಪ್ರಮಾಣ

source: Unit
hi_kh: इकाई
kn: ಘಟಕ

source: Enter custom unit
hi_kh: इकाई भरें
kn: ಕಸ್ಟಮ್ ಘಟಕವನ್ನು ನಮೂದಿಸಿ

source: Frequency
hi_kh: कब-कब
kn: ಆವರ್ತನ

source: Specify frequency
hi_kh: समय बताएं
kn: ಆವರ್ತನವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ

source: Recommended crops
hi_kh: सलाह फसल
kn: ಶಿಫಾರಸು ಮಾಡಲಾದ ಬೆಳೆಗಳು

source: Based on farm conditions
hi_kh: खेत के हिसाब से
kn: ಜಮೀನು ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಆಧರಿಸಿ

source: Why this crop?
hi_kh: ई फसल क्यों?
kn: ಈ ಬೆಳೆ ಏಕೆ?

source: View details
hi_kh: विवरण देखें
kn: ವಿವರಗಳನ್ನು ವೀಕ್ಷಿಸಿ

# kmAway
source: {distance} km away
hi_kh: {distance} किमी दूर
kn: {distance} ಕಿಮೀ ದೂರ

# mspPrev
source: MSP/Prev {price}
hi_kh: MSP/पिछला {price}
kn: MSP/ಹಿಂದಿನ {price}

source: Onion
hi_kh: प्याज
kn: ಈರುಳ್ಳಿ

source: Mustard
hi_kh: सरसों
kn: ಸಾಸಿವೆ

source: All
hi_kh: सब
kn: ಎಲ್ಲಾ

source: Videos
hi_kh: वीडियो
kn: ವೀಡಿಯೊಗಳು

# pestLabel
source: Pest
hi: कीट
hi_kh: कीड़ा
kn: ಕೀಟ

# cropLabel
source: Crop
hi: फसल
hi_kh: फसल
kn: ಬೆಳೆ

# termsAndConditions
source: By continuing, you agree to our Terms & Privacy Policy
hi: जारी रखकर, आप हमारी शर्तों और गोपनीयता नीति से सहमत होते हैं
hi_kh: आगे बढ़के, तोनी हमर नियम आर गोपनीयता नीति से सहमत होवे ही
kn: ಮುಂದುವರಿಯುವ ಮೂಲಕ, ನೀವು ನಮ್ಮ ನಿಯಮಗಳು ಮತ್ತು ಗೌಪ್ಯತೆ ನೀತಿಯನ್ನು ಒಪ್ಪುತ್ತೀರಿ

source: DAP
hi: डीएपी

# excellentSoilMatchDesc
source: Soil properties match perfectly with crop requirements.
hi: Your loamy soil with pH 6.5 is perfect for cotton cultivation. The NPK ratio matches cotton requirements.

# weatherSuitabilityDesc
source: Current weather conditions are optimal for sowing.
hi: Current temperature (28-32°C) and upcoming rainfall pattern are ideal for cotton sowing season.

# rotationBenefitDesc
source: Helps in restoring soil nitrogen levels.
hi: Cotton after wheat provides excellent crop rotation benefits, reducing pest pressure and improving soil health.

# marketAdvantageDesc
source: High demand expected in upcoming season.
hi: Current cotton prices are ₹7,200/quintal with 12% upward trend. MSP support available at ₹6,620/quintal.

# proTipContent
source: Ensure proper drainage to prevent waterlogging.
hi: Ensure proper spacing of 2-3 feet between plants and maintain adequate irrigation during flowering stage for maximum yield.
