Repository: Kishan2123/FarmAura_application
Catalog: lib/l10n/app_*.arb
Languages: hi, hi_kh, kn

# appTitle
source: FarmAura
hi_kh: फार्मऔरा
kn: ಫಾರ್ಮ್‌ಔರಾ

# dashboardGreetingMorning
source: Good morning
hi: सुप्रभात
hi_kh: जोहार
kn: ಶುಭೋದಯ

# dashboardGreetingAfternoon
source: Good afternoon
hi: शुभ दोपहर
hi_kh: जोहार
kn: ಶುಭ ಮಧ್ಯಾಹ್ನ

# dashboardGreetingEvening
source: Good evening
hi: शुभ संध्या
hi_kh: जोहार
kn: ಶುಭ ಸಂಜೆ

source: Crop advisor
hi: फसल सलाहकार
hi_kh: फसल सलाह
kn: ಬೆಳೆ ಸಲಹೆಗಾರ

source: Pest scanner
hi: कीट स्कैनर
hi_kh: कीड़ा जांच
kn: ಕೀಟ ಸ್ಕ್ಯಾನರ್

source: Soil test
hi: मृदा परीक्षण
hi_kh: माटी जांच
kn: ಮಣ್ಣು ಪರೀಕ್ಷೆ

source: Market prices
hi: बाजार भाव
hi_kh: बाजार भाव
kn: ಮಾರುಕಟ್ಟೆ ಬೆಲೆಗಳು

# profitAndLoss
source: Profit & loss
hi: लाभ और हानि
hi_kh: लाभ-हानि
kn: ಲಾಭ ಮತ್ತು ನಷ್ಟ

source: Community
hi: समुदाय
hi_kh: समाज
kn: ಸಮುದಾಯ

# locationLabel
source: Location
hi: स्थान
hi_kh: जगह
kn: ಸ್ಥಳ

# searchHint
source: Ask KrishiMitra anything…
hi: कृषिमित्र से कुछ भी पूछें...
hi_kh: कृषिमित्र से कुछ भी पूछें...
kn: ಕೃಷಿಮಿತ್ರನನ್ನು ಏನಾದರೂ ಕೇಳಿ...

source: Quick actions
hi: त्वरित कार्य
hi_kh: जल्दी काम
kn: ತ್ವರಿತ ಕ್ರಮಗಳು

source: Important updates
hi: महत्वपूर्ण अपडेट
hi_kh: जरूरी खबर
kn: ಪ್ರಮುಖ ನವೀಕರಣಗಳು

source: Farm performance
hi: खेत का प्रदर्शन
hi_kh: खेती का हाल
kn: ಕೃಷಿ ಕಾರ್ಯಕ್ಷಮತೆ

source: Home
hi: होम
hi_kh: घर
kn: ಮನೆ

source: Profile
hi: प्रोफाइल
hi_kh: प्रोफाइल
kn: ಪ್ರೊಫೈಲ್

source: Personal finance
hi: व्यक्तिगत वित्त
hi_kh: पैसा-कौड़ी
kn: ವೈಯಕ್ತಿಕ ಹಣಕಾಸು

source: Settings
hi: सेटिंग्स
hi_kh: सेटिंग
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು

source: Soil health card upload
hi: मृदा स्वास्थ्य कार्ड अपलोड
hi_kh: माटी कार्ड चढ़ाएं
kn: ಮಣ್ಣಿನ ಆರೋಗ್ಯ ಕಾರ್ಡ್ ಅಪ್‌ಲೋಡ್

source: Government schemes
hi: सरकारी योजनाएं
hi_kh: सरकारी योजना
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು

source: Language
hi: भाषा
hi_kh: भाषा
kn: ಭಾಷೆ

source: Logout
hi: लॉग आउट
hi_kh: बाहर निकलें
kn: ಲಾಗ್ ಔಟ್

source: My profile
hi: मेरी प्रोफाइल
hi_kh: हमर प्रोफाइल
kn: ನನ್ನ ಪ್ರೊಫೈಲ್

source: My farm summary
hi: मेरे खेत का सारांश
hi_kh: हमर खेत का हाल
kn: ನನ್ನ ಕೃಷಿ ಸಾರಾಂಶ

source: Crop history
hi: फसल इतिहास
hi_kh: फसल इतिहास
kn: ಬೆಳೆ ಇತಿಹಾಸ

source: Saved recommendations
hi: सहेजी गई सिफारिशें
hi_kh: सहेजल् सलाह
kn: ಉಳಿಸಿದ ಶಿಫಾರಸುಗಳು

source: Actions
hi: कार्य
hi_kh: काम
kn: ಕ್ರಮಗಳು

source: Crops grown
hi: उगाई गई फसलें
hi_kh: उगावल फसल
kn: ಬೆಳೆದ ಬೆಳೆಗಳು

source: Active fields
hi: सक्रिय खेत
hi_kh: चालू खेत
kn: ಸಕ್ರಿಯ ಜಮೀನುಗಳು

source: Rating
hi: रेटिंग
hi_kh: रेटिंग
kn: ರೇಟಿಂಗ್

source: Land size
hi: जमीन का आकार
hi_kh: जमीन का नाप
kn: ಜಮೀನು ಗಾತ್ರ

source: Irrigation
hi: सिंचाई
hi_kh: पटवन
kn: ನೀರಾವರಿ

source: Soil type
hi: मिट्टी का प्रकार
hi_kh: माटी के प्रकार
kn: ಮಣ್ಣಿನ ಪ್ರಕಾರ

source: Main crops
hi: मुख्य फसलें
hi_kh: मुख्य फसल
kn: ಮುಖ್ಯ ಬೆಳೆಗಳು

# noCropHistory
source: No crop history yet
hi: अभी तक कोई फसल इतिहास नहीं
hi_kh: कोनो फसल इतिहास नइखे
kn: ಇನ್ನೂ ಯಾವುದೇ ಬೆಳೆ ಇತಿಹಾಸವಿಲ್ಲ

source: Edit profile
hi: प्रोफाइल संपादित करें
hi_kh: प्रोफाइल सुधारें
kn: ಪ್ರೊಫೈಲ್ ಎಡಿಟ್ ಮಾಡಿ

source: Manage farms
hi: खेत प्रबंधित करें
hi_kh: खेत संभालें
kn: ಜಮೀನುಗಳನ್ನು ನಿರ್ವಹಿಸಿ

# govJharkhand
source: Government of Jharkhand
hi: झारखंड सरकार
hi_kh: झारखंड सरकार
kn: ಜಾರ್ಖಂಡ್ ಸರ್ಕಾರ

# govSubtitle
source: Smart farming pilot partner
hi: स्मार्ट फार्मिंग पायलट पार्टनर
hi_kh: स्मार्ट खेती साथी
kn: ಸ್ಮಾರ್ಟ್ ಕೃಷಿ ಪೈಲಟ್ ಪಾಲುದಾರ

source: Version
hi: संस्करण
hi_kh: वर्जन
kn: ಆವೃತ್ತಿ

source: Financial overview
hi: वित्तीय अवलोकन
hi_kh: पैसा का हिसाब
kn: ಹಣಕಾಸು ಅವಲೋಕನ

source: Total revenue
hi: कुल राजस्व
hi_kh: कुल कमाई
kn: ಒಟ್ಟು ಆದಾಯ

source: Net profit
hi: शुद्ध लाभ
hi_kh: शुद्ध लाभ
kn: ನಿವ್ವಳ ಲಾಭ

source: Profit margin
hi: लाभ मार्जिन
hi_kh: मुनाफा
kn: ಲಾಭದ ಪ್ರಮಾಣ

source: Add income
hi: आय जोड़ें
hi_kh: कमाई जोड़ें
kn: ಆದಾಯ ಸೇರಿಸಿ

source: Add expense
hi: व्यय जोड़ें
hi_kh: खर्चा जोड़ें
kn: ಖರ್ಚು ಸೇರಿಸಿ

source: Savings goals
hi: बचत लक्ष्य
hi_kh: बचत लक्ष्य
kn: ಉಳಿತಾಯ ಗುರಿಗಳು

source: Active loans
hi: सक्रिय ऋण
hi_kh: चल रहल कर्ज
kn: ಸಕ್ರಿಯ ಸಾಲಗಳು

source: Recent transactions
hi: हाल के लेनदेन
hi_kh: हाल का लेन-देन
kn: ಇತ್ತೀಚಿನ ವಹಿವಾಟುಗಳು

source: Monthly profit trend
hi: मासिक लाभ प्रवृत्ति
hi_kh: महीना का लाभ
kn: ಮಾಸಿಕ ಲಾಭದ ಪ್ರವೃತ್ತಿ

source: Month
hi: महीना
hi_kh: महीना
kn: ತಿಂಗಳು

source: Quarter
hi: तिमाही
hi_kh: तिमाही
kn: ತ್ರೈಮಾಸಿಕ

source: Year
hi: वर्ष
hi_kh: साल
kn: ವರ್ಷ

source: Crop-wise analysis
hi: फसल-वार विश्लेषण
hi_kh: फसल वार हिसाब
kn: ಬೆಳೆವಾರು ವಿಶ್ಲೇಷಣೆ

source: Investment
hi: निवेश
hi_kh: लागत
kn: ಹೂಡಿಕೆ

source: Revenue
hi: राजस्व
hi_kh: कमाई
kn: ಆದಾಯ

source: Expense breakdown
hi: व्यय विवरण
hi_kh: खर्चा का ब्यौरा
kn: ಖರ್ಚಿನ ವಿವರ

source: Upcoming payments
hi: आगामी भुगतान
hi_kh: आवे वाला भुगतान
kn: ಮುಂಬರುವ ಪಾವತಿಗಳು

source: Change language
hi: भाषा बदलें
hi_kh: भाषा बदलें
kn: ಭಾಷೆ ಬದಲಾಯಿಸಿ

source: Select language
hi: भाषा चुनें
hi_kh: भाषा चुनें
kn: ಭಾಷೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ

source: Cancel
hi: रद्द करें
hi_kh: रद्द करें
kn: ರದ್ದುಮಾಡಿ

source: Apply
hi: लागू करें
hi_kh: लागू करें
kn: ಅನ್ವಯಿಸಿ

source: Today
hi: आज
hi_kh: आज
kn: ಇಂದು

source: Updated
hi: अपडेट किया गया
hi_kh: अपडेट भेल
kn: ನವೀಕರಿಸಲಾಗಿದೆ

# bestMandi
source: Best Mandi for {crop}
hi: {crop} के लिए सर्वश्रेष्ठ मंडी
hi_kh: {crop} खातिर बढ़िया मंडी
kn: {crop} ಗಾಗಿ ಅತ್ಯುತ್ತಮ ಮಂಡಿ

source: Recommended
hi: अनुशंसित
hi_kh: सलाह दिहल गेल
kn: ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ

source: Also good option
hi: अच्छा विकल्प
hi_kh: ई भी बढ़िया है
kn: ಇದು ಕೂಡ ಒಳ್ಳೆಯ ಆಯ್ಕೆ

source: Alternative Mandi
hi: वैकल्पिक मंडी
hi_kh: दूसरा मंडी
kn: ಪರ್ಯಾಯ ಮಂಡಿ

source: Selling Price
hi: विक्रय मूल्य
hi_kh: बेचे वाला दाम
kn: ಮಾರಾಟ ಬೆಲೆ

source: Transport Cost
hi: परिवहन लागत
hi_kh: भाड़ा
kn: ಸಾರಿಗೆ ವೆಚ್ಚ

# estimatedNetProfit
source: Est. Net Profit
hi: अनुमानित शुद्ध लाभ
hi_kh: अंदाजी लाभ
kn: ಅಂದಾಜು ನಿವ್ವಳ ಲಾಭ

source: All Market Prices
hi: सभी बाजार भाव
hi_kh: सब बाजार भाव
kn: ಎಲ್ಲಾ ಮಾರುಕಟ್ಟೆ ಬೆಲೆಗಳು

source: Fetching prices...
hi: कीमतें प्राप्त की जा रही हैं...
hi_kh: भाव ला रहल है...
kn: ಬೆಲೆಗಳನ್ನು ಪಡೆಯಲಾಗುತ್ತಿದೆ...

source: Could not load prices
hi: कीमतें लोड नहीं की जा सकीं
hi_kh: भाव नइखे मिलल
kn: ಬೆಲೆಗಳನ್ನು ಲೋಡ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ

source: Retry
hi: पुनः प्रयास करें
hi_kh: फिर से
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ

source: No prices available
hi: कोई कीमत उपलब्ध नहीं
hi_kh: भाव उपलब्ध नइखे
kn: ಯಾವುದೇ ಬೆಲೆಗಳು ಲಭ್ಯವಿಲ್ಲ

# livePrices
source: Live prices from nearby mandis
hi: आस-पास की मंडियों से लाइव कीमतें
hi_kh: नजदीकी मंडी से ताजा भाव
kn: ಹತ್ತಿರದ ಮಂಡಿಗಳಿಂದ ಲೈವ್ ಬೆಲೆಗಳು

source: Yield
hi: उपज
hi_kh: पैदावार
kn: ಇಳುವರಿ

source: Profit
hi: लाभ
hi_kh: लाभ
kn: ಲಾಭ

source: Tomorrow
hi: कल
hi_kh: कल
kn: ನಾಳೆ

source: Help & Support
hi: सहायता और समर्थन
hi_kh: मदद
kn: ಸಹಾಯ ಮತ್ತು ಬೆಂಬಲ

source: Pest detection
hi: कीट पहचान
hi_kh: कीड़ा पहचान
kn: ಕೀಟ ಪತ್ತೆ

# pestDetectionSubtitle
source: Upload a photo of the affected crop leaf to detect pests.
hi: कीटों का पता लगाने के लिए फसल की पत्ती की फोटो अपलोड करें।
hi_kh: कीड़ा पहचाने खातिर पत्ता का फोटो खींचें।
kn: ಕೀಟಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲು ಬಾಧಿತ ಬೆಳೆ ಎಲೆಯ ಫೋಟೋವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ.

# pestDetectionInfo
source: Use a clear, close-up photo in good lighting.
hi: अच्छी रोशनी में स्पष्ट, क्लोज़-अप फोटो का उपयोग करें।
hi_kh: साफ और बढ़िया रोशनी में फोटो लें।
kn: ಉತ್ತಮ ಬೆಳಕಿನಲ್ಲಿ ಸ್ಪಷ್ಟವಾದ, ಹತ್ತಿರದ ಫೋಟೋವನ್ನು ಬಳಸಿ.

source: Open camera
hi: कैमरा खोलें
hi_kh: कैमरा खोलें
kn: ಕ್ಯಾಮೆರಾ ತೆರೆಯಿರಿ

source: Upload image
hi: छवि अपलोड करें
hi_kh: फोटो डालें
kn: ಚಿತ್ರ ಅಪ್‌ಲೋಡ್ ಮಾಡಿ

source: Leaf blight detected
hi: लीफ ब्लाइट का पता चला
hi_kh: झुलसा रोग मिलल
kn: ಎಲೆ ರೋಗ ಪತ್ತೆಯಾಗಿದೆ

source: Severity: High
hi: गंभीरता: उच्च
hi_kh: खतरा: ज्यादा
kn: ತೀವ್ರತೆ: ಹೆಚ್ಚು

source: Recommended actions
hi: अनुशंसित कार्रवाई
hi_kh: उपाय
kn: ಶಿಫಾರಸು ಮಾಡಲಾದ ಕ್ರಮಗಳು

source: Chemical control
hi: रासायनिक नियंत्रण
hi_kh: दवा छिड़काव
kn: ರಾಸಾಯನಿಕ ನಿಯಂತ್ರಣ

source: Biological control
hi: जैविक नियंत्रण
hi_kh: जैविक उपाय
kn: ಜೈವಿಕ ನಿಯಂತ್ರಣ

# organicAlternativeTitle
source: Organic alternative
hi: जैविक विकल्प
hi_kh: देसी उपाय
kn: ಸಾವಯವ ಪರ್ಯಾಯ

# organicAlternativeDesc
source: Use approved organic formulations and follow dosage instructions.
hi: अनुमोदित जैविक फॉर्मूलेशन का उपयोग करें और खुराक निर्देशों का पालन करें।
hi_kh: मंजूर जैविक दवा का उपयोग करें।
kn: ಅನುಮೋದಿತ ಸಾವಯವ ಸೂತ್ರೀಕರಣಗಳನ್ನು ಬಳಸಿ ಮತ್ತು ಡೋಸೇಜ್ ಸೂಚನೆಗಳನ್ನು ಅನುಸರಿಸಿ.

source: Scan again
hi: फिर से स्कैन करें
hi_kh: फिर से देखें
kn: ಮತ್ತೆ ಸ್ಕ್ಯಾನ್ ಮಾಡಿ

source: Save report
hi: रिपोर्ट सहेजें
hi_kh: रिपोर्ट रखें
kn: ವರದಿ ಉಳಿಸಿ

source: Farmer
hi: किसान
hi_kh: किसान
kn: ರೈತ

source: Jharkhand
hi: झारखंड
hi_kh: झारखंड
kn: ಜಾರ್ಖಂಡ್

# noSavedRecommendations
source: No saved recommendations yet.
hi: अभी तक कोई सिफारिश सहेजी नहीं गई है।
hi_kh: कोनो सलाह सहेजल नइखे।
kn: ಇನ್ನೂ ಯಾವುದೇ ಉಳಿಸಿದ ಶಿಫಾರಸುಗಳಿಲ್ಲ.

source: Suitability
hi: उपयुक्तता
hi_kh: अनुकूलता
kn: ಸೂಕ್ತತೆ

source: Logout clicked
hi: लॉगआउट पर क्लिक किया गया
hi_kh: बाहर निकलें
kn: ಲಾಗ್ ಔಟ್ ಕ್ಲಿಕ್ ಮಾಡಲಾಗಿದೆ

source: Preferences
hi: प्राथमिकताएं
hi_kh: पसंद
kn: ಆದ್ಯತೆಗಳು

source: Notifications
hi: सूचनाएं
hi_kh: सूचना
kn: ಅಧಿಸೂಚನೆಗಳು

source: Enabled
hi: सक्षम
hi_kh: चालू
kn: ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ

source: Disabled
hi: अक्षम
hi_kh: बंद
kn: ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ

source: Location
hi: स्थान
hi_kh: जगह
kn: ಸ್ಥಳ

source: Privacy & security
hi: गोपनीयता और सुरक्षा
hi_kh: सुरक्षा
kn: ಗೌಪ್ಯತೆ ಮತ್ತು ಭದ್ರತೆ

source: Privacy policy
hi: गोपनीयता नीति
hi_kh: गोपनीयता नीति
kn: ಗೌಪ್ಯತಾ ನೀತಿ

# privacyPolicySubtitle
source: View how your data is used.
hi: देखें कि आपके डेटा का उपयोग कैसे किया जाता है।
hi_kh: डाटा कैसे उपयोग होता है देखें।
kn: ನಿಮ್ಮ ಡೇಟಾವನ್ನು ಹೇಗೆ ಬಳಸಲಾಗುತ್ತದೆ ಎಂಬುದನ್ನು ವೀಕ್ಷಿಸಿ.

source: Terms of service
hi: सेवा की शर्तें
hi_kh: सेवा शर्तें
kn: ಸೇವಾ ನಿಯಮಗಳು

# termsOfServiceSubtitle
source: Read the terms of using this app.
hi: इस ऐप का उपयोग करने की शर्तें पढ़ें।
hi_kh: ऐप के नियम पढ़ें।
kn: ಈ ಅಪ್ಲಿಕೇಶನ್ ಬಳಸುವ ನಿಯಮಗಳನ್ನು ಓದಿ.

source: Support
hi: समर्थन
hi_kh: सहयोग
kn: ಬೆಂಬಲ

# helpSupportSubtitle
source: Get help from the FarmAura team.
hi: FarmAura टीम से सहायता प्राप्त करें।
hi_kh: फार्मऔरा टीम से मदद लें।
kn: ಫಾರ್ಮ್‌ಔರಾ ತಂಡದಿಂದ ಸಹಾಯ ಪಡೆಯಿರಿ.

source: About
hi: के बारे में
hi_kh: बारे में
kn: ಕುರಿತು

# aboutSubtitle
source: Learn more about FarmAura.
hi: FarmAura के बारे में अधिक जानें।
hi_kh: फार्मऔरा के बारे में जानें।
kn: ಫಾರ್ಮ್‌ಔರಾ ಬಗ್ಗೆ ಇನ್ನಷ್ಟು ತಿಳಿಯಿರಿ.

# whyCropTitle
source: Why was {crop} recommended?
hi: {crop} की सिफारिश क्यों की गई?
hi_kh: {crop} क्यों लगावें?
kn: {crop} ಅನ್ನು ಏಕೆ ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ?

# whyCropSubtitle
source: Detailed reasoning for {crop} based on soil, weather, and market conditions.
hi: मिट्टी, मौसम और बाजार की स्थितियों के आधार पर {crop} के लिए विस्तृत तर्क।
hi_kh: माटी, मौसम और बाजार के हिसाब से {crop} का विश्लेषण।
kn: ಮಣ್ಣು, ಹವಾಮಾನ ಮತ್ತು ಮಾರುಕಟ್ಟೆ ಪರಿಸ್ಥಿತಿಗಳ ಆಧಾರದ ಮೇಲೆ {crop} ಗಾಗಿ ವಿವರವಾದ ಕಾರಣ.

source: Suitability score
hi: उपयुक्तता स्कोर
hi_kh: अनुकूलता नंबर
kn: ಸೂಕ್ತತೆ ಸ್ಕೋರ್

source: Highly recommended
hi: अत्यधिक अनुशंसित
hi_kh: बहुत बढ़िया
kn: ಹೆಚ್ಚು ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ

source: Key factors
hi: मुख्य कारक
hi_kh: मुख्य बात
kn: ಪ್ರಮುಖ ಅಂಶಗಳು

source: Excellent soil match
hi: उत्कृष्ट मिट्टी का मेल
hi_kh: माटी खातिर बहुत बढ़िया
kn: ಅತ್ಯುತ್ತಮ ಮಣ್ಣಿನ ಹೊಂದಾಣಿಕೆ

source: Weather suitability
hi: मौसम की उपयुक्तता
hi_kh: मौसम अनुकूल
kn: ಹವಾಮಾನ ಸೂಕ್ತತೆ

source: Rotation benefit
hi: फसल चक्र का लाभ
hi_kh: फसल चक्र लाभ
kn: ಬೆಳೆ ಬದಲಾವಣೆ ಲಾಭ

source: Market advantage
hi: बाजार का लाभ
hi_kh: बाजार लाभ
kn: ಮಾರುಕಟ್ಟೆ ಲಾಭ

source: Growth timeline
hi: विकास की समयरेखा
hi_kh: बढ़वार समय
kn: ಬೆಳವಣಿಗೆಯ ಸಮಯರೇಖೆ

source: Sowing
hi: बुवाई
hi_kh: बुआई
kn: ಬಿತ್ತನೆ

source: Germination
hi: अंकुरण
hi_kh: अंकुरण
kn: ಮೊಳಕೆಯೊಡೆಯುವಿಕೆ

source: Vegetative
hi: वानस्पतिक
hi_kh: बढ़वार
kn: ಸಸ್ಯಕ

source: Flowering
hi: पुष्पन
hi_kh: फूल
kn: ಹೂಬಿಡುವಿಕೆ

source: Boll formation
hi: बॉल का बनना
hi_kh: फल
kn: ಕಾಯಿ ರಚನೆ

source: Harvest
hi: कटाई
hi_kh: कटाई
kn: ಕೊಯ್ಲು

source: Pro tip
hi: प्रो टिप
hi_kh: खास सलाह
kn: ಪ್ರೊ ಸಲಹೆ

source: Back to results
hi: परिणामों पर वापस जाएं
hi_kh: वापस
kn: ಫಲಿತಾಂಶಗಳಿಗೆ ಹಿಂತಿರುಗಿ

source: Save plan
hi: योजना सहेजें
hi_kh: प्लान रखें
kn: ಯೋಜನೆ ಉಳಿಸಿ

source: Back
hi: वापस
hi_kh: पीछे
kn: ಹಿಂದಕ್ಕೆ

source: Weather forecast
hi: मौसम का पूर्वानुमान
hi_kh: मौसम जानकारी
kn: ಹವಾಮಾನ ಮುನ್ಸೂಚನೆ

source: Feels like
hi: महसूस होता है
hi_kh: महसूस
kn: ಅನಿಸುತ್ತದೆ

source: Humidity
hi: नमी
hi_kh: नमी
kn: ಆರ್ದ್ರತೆ

source: Wind
hi: हवा
hi_kh: हवा
kn: ಗಾಳಿ

source: Visibility
hi: दृश्यता
hi_kh: दृश्यता
kn: ಗೋಚರತೆ

source: Pressure
hi: दबाव
hi_kh: दबाव
kn: ಒತ್ತಡ

# sevenDayForecast
source: 7-day forecast
hi: 7-दिवसीय पूर्वानुमान
hi_kh: 7 दिन का मौसम
kn: 7 ದಿನದ ಮುನ್ಸೂಚನೆ

source: Heavy rain warning
hi: भारी बारिश की चेतावनी
hi_kh: भारी बारिश चेतावनी
kn: ಭಾರೀ ಮಳೆ ಎಚ್ಚರಿಕೆ

source: Nitrogen
hi: नाइट्रोजन
hi_kh: नाइट्रोजन
kn: ಸಾರಜನಕ

source: Phosphorus
hi: फास्फोरस
hi_kh: फास्फोरस
kn: ರಂಜಕ

source: Potassium
hi: पोटेशियम
hi_kh: पोटाश
kn: ಪೊಟ್ಯಾಸಿಯಮ್

source: Soil details
hi: मिट्टी का विवरण
hi_kh: माटी विवरण
kn: ಮಣ್ಣಿನ ವಿವರಗಳು

source: Soil status: Good
hi: मिट्टी की स्थिति: अच्छी
hi_kh: माटी: बढ़िया
kn: ಮಣ್ಣಿನ ಸ್ಥಿತಿ: ಉತ್ತಮ

source: Maize
hi: मक्का
hi_kh: मक्का
kn: ಮೆಕ್ಕೆಜೋಳ

source: Wheat
hi: गेहूं
hi_kh: गेहूं
kn: ಗೋಧಿ

source: Location required
hi: स्थान आवश्यक है
hi_kh: जगह चाहिए
kn: ಸ್ಥಳ ಅಗತ್ಯವಿದೆ

source: Unavailable
hi: अनुपलब्ध
hi_kh: नइखे
kn: ಲಭ್ಯವಿಲ್ಲ

source: Loading
hi: लोड हो रहा है
hi_kh: रुकें...
kn: ಲೋಡ್ ಆಗುತ್ತಿದೆ

# npkGood
source: NPK levels good
hi: NPK स्तर अच्छा है
hi_kh: NPK ठीक है
kn: NPK ಮಟ್ಟಗಳು ಉತ್ತಮವಾಗಿವೆ

source: Pest alert nearby
hi: आस-पास कीट चेतावनी
hi_kh: कीड़ा का खतरा
kn: ಹತ್ತಿರದಲ್ಲಿ ಕೀಟ ಎಚ್ಚರಿಕೆ

source: Heavy rain tomorrow
hi: कल भारी बारिश
hi_kh: कल भारी बारिश
kn: ನಾಳೆ ಭಾರೀ ಮಳೆ

source: Wheat price
hi: गेहूं की कीमत
hi_kh: गेहूं भाव
kn: ಗೋಧಿ ಬೆಲೆ

source: Crop health
hi: फसल स्वास्थ्य
hi_kh: फसल सेहत
kn: ಬೆಳೆ ಆರೋಗ್ಯ

source: Soil quality
hi: मिट्टी की गुणवत्ता
hi_kh: माटी गुण
kn: ಮಣ್ಣಿನ ಗುಣಮಟ್ಟ

source: AI powered
hi: AI संचालित
hi_kh: AI आधारित
kn: AI ಚಾಲಿತ

source: Crop advisory
hi: फसल सलाह
hi_kh: फसल सलाह
kn: ಬೆಳೆ ಸಲಹೆ

source: Get personalized recommendations
hi: व्यक्तिगत सिफारिशें प्राप्त करें
hi_kh: खास सलाह पाएं
kn: ವೈಯಕ್ತಿಕಗೊಳಿಸಿದ ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ

source: Start crop advisory
hi: फसल सलाह शुरू करें
hi_kh: सलाह शुरू करें
kn: ಬೆಳೆ ಸಲಹೆಯನ್ನು ಪ್ರಾರಂಭಿಸಿ

source: Accuracy
hi: सटीकता
hi_kh: सटीकता
kn: ನಿಖರತೆ

source: Farmers
hi: किसान
hi_kh: किसान
kn: ರೈತರು

source: Crops
hi: फसलें
hi_kh: फसल
kn: ಬೆಳೆಗಳು

source: How it works
hi: यह कैसे काम करता है
hi_kh: ई कैसे काम करेला
kn: ಇದು ಹೇಗೆ ಕೆಲಸ ಮಾಡುತ್ತದೆ

source: Enter farm details
hi: खेत का विवरण दर्ज करें
hi_kh: खेत का ब्यौरा दें
kn: ಜಮೀನು ವಿವರಗಳನ್ನು ನಮೂದಿಸಿ

source: Provide info
hi: जानकारी प्रदान करें
hi_kh: जानकारी दें
kn: ಮಾಹಿತಿ ಒದಗಿಸಿ

source: Share soil data
hi: मिट्टी का डेटा साझा करें
hi_kh: माटी जानकारी दें
kn: ಮಣ್ಣಿನ ಡೇಟಾವನ್ನು ಹಂಚಿಕೊಳ್ಳಿ

source: Enter soil info
hi: मिट्टी की जानकारी दर्ज करें
hi_kh: माटी ब्यौरा भरें
kn: ಮಣ್ಣಿನ ಮಾಹಿತಿ ನಮೂದಿಸಿ

source: Get AI recommendations
hi: AI सिफारिशें प्राप्त करें
hi_kh: AI सलाह लें
kn: AI ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ

source: Receive suggestions
hi: सुझाव प्राप्त करें
hi_kh: सुझाव पाएं
kn: ಸಲಹೆಗಳನ್ನು ಸ್ವೀಕರಿಸಿ

source: Why use advisory?
hi: सलाह का उपयोग क्यों करें?
hi_kh: सलाह क्यों लें?
kn: ಸಲಹೆಯನ್ನು ಏಕೆ ಬಳಸಬೇಕು?

source: Maximize profits
hi: मुनाफा अधिकतम करें
hi_kh: ज्यादा मुनाफा
kn: ಲಾಭವನ್ನು ಹೆಚ್ಚಿಸಿ

source: Reduce risk
hi: जोखिम कम करें
hi_kh: कम जोखिम
kn: ಅಪಾಯವನ್ನು ಕಡಿಮೆ ಮಾಡಿ

source: Market demand suggestions
hi: बाजार मांग सुझाव
hi_kh: बाजार मांग
kn: ಮಾರುಕಟ್ಟೆ ಬೇಡಿಕೆ ಸಲಹೆಗಳು

source: Growing guides
hi: खेती गाइड
hi_kh: खेती गाइड
kn: ಬೆಳೆಯುವ ಮಾರ್ಗದರ್ಶಿಗಳು

source: Crop details
hi: फसल विवरण
hi_kh: फसल विवरण
kn: ಬೆಳೆ ವಿವರಗಳು

source: Cotton
hi: कपास
hi_kh: कपास
kn: ಹತ್ತಿ

source: Expected profit
hi: अपेक्षित लाभ
hi_kh: उम्मीद मुनाफा
kn: ನಿರೀಕ್ಷಿತ ಲಾಭ

source: Per acre
hi: प्रति एकड़
hi_kh: प्रति एकड़
kn: ಪ್ರತಿ ಎಕರೆಗೆ

source: Yield estimate
hi: उपज अनुमान
hi_kh: पैदावार अनुमान
kn: ಇಳುವರಿ ಅಂದಾಜು

source: Growing requirements
hi: खेती की आवश्यकताएं
hi_kh: खेती जरूरत
kn: ಬೆಳೆಯುವ ಅಗತ್ಯತೆಗಳು

source: Growing period
hi: खेती की अवधि
hi_kh: समय
kn: ಬೆಳೆಯುವ ಅವಧಿ

# growingPeriodValue
source: 150-180 days
hi: 150-180 दिन
hi_kh: 150-180 दिन
kn: 150-180 ದಿನಗಳು

source: Water requirement
hi: पानी की आवश्यकता
hi_kh: पानी
kn: ನೀರಿನ ಅಗತ್ಯತೆ

# waterRequirementValue
source: High
hi: उच्च
hi_kh: ज्यादा
kn: ಹೆಚ್ಚು

source: Temperature range
hi: तापमान सीमा
hi_kh: तापमान
kn: ತಾಪಮಾನ ಶ್ರೇಣಿ

source: Black cotton soil, Red soil
hi: काली कपास मिट्टी, लाल मिट्टी
hi_kh: काली माटी, लाल माटी
kn: ಕಪ್ಪು ಹತ್ತಿ ಮಣ್ಣು, ಕೆಂಪು ಮಣ್ಣು

source: pH range
hi: pH सीमा
hi_kh: pH मान
kn: pH ಶ್ರೇಣಿ

source: Rainfall
hi: वर्षा
hi_kh: बारिश
kn: ಮಳೆ

source: Growing stages
hi: विकास के चरण
hi_kh: बढ़वार चरण
kn: ಬೆಳೆಯುವ ಹಂತಗಳು

# sowingDesc
source: Seed sowing and germination phase
hi: बीज बुवाई और अंकुरण चरण
hi_kh: बुआई और जमाव
kn: ಬೀಜ ಬಿತ್ತನೆ ಮತ್ತು ಮೊಳಕೆಯೊಡೆಯುವ ಹಂತ

# vegetativeDesc
source: Leaf and stem development
hi: पत्ती और तने का विकास
hi_kh: पत्ता और तना
kn: ಎಲೆ ಮತ್ತು ಕಾಂಡದ ಬೆಳವಣಿಗೆ

# floweringDesc
source: Flower bud initiation and blooming
hi: फूल कली की शुरुआत और खिलना
hi_kh: फूल आवे के समय
kn: ಹೂವಿನ ಮೊಗ್ಗು ಪ್ರಾರಂಭ ಮತ್ತು ಅರಳುವಿಕೆ

# bollFormationDesc
source: Boll development and maturation
hi: बॉल का विकास और परिपक्वता
hi_kh: फल बने के समय
kn: ಕಾಯಿ ಬೆಳವಣಿಗೆ ಮತ್ತು ಪಕ್ವತೆ

source: Harvesting
hi: कटाई
hi_kh: कटाई
kn: ಕೊಯ್ಲು

# harvestingDesc
source: Picking of mature bolls
hi: परिपक्व बॉल्स की तुड़ाई
hi_kh: तैयार फसल तोड़ना
kn: ಬಲಿತ ಕಾಯಿಗಳನ್ನು ಕೀಳುವುದು

source: Fertilizer plan
hi: उर्वरक योजना
hi_kh: खाद प्लान
kn: ಗೊಬ್ಬರ ಯೋಜನೆ

source: Basal
hi: बेसल
hi_kh: शुरुआती
kn: ಮೂಲ

# firstDose
source: 1st Dose
hi: पहली खुराक
hi_kh: पहला खुराक
kn: 1 ನೇ ಡೋಸ್

source: Urea
hi: यूरिया
hi_kh: यूरिया
kn: ಯೂರಿಯಾ

# secondDose
source: 2nd Dose
hi: दूसरी खुराक
hi_kh: दूसरा खुराक
kn: 2 ನೇ ಡೋಸ್

# thirdDose
source: 3rd Dose
hi: तीसरी खुराक
hi_kh: तीसरा खुराक
kn: 3 ನೇ ಡೋಸ್

source: Potash
hi: पोटाश
hi_kh: पोटाश
kn: ಪೊಟ್ಯಾಷ್

source: Irrigation schedule
hi: सिंचाई अनुसूची
hi_kh: पटवन समय
kn: ನೀರಾವರಿ ವೇಳಾಪಟ್ಟಿ

source: Sowing to germination
hi: बुवाई से अंकुरण तक
hi_kh: बुआई से जमाव
kn: ಬಿತ್ತನೆಯಿಂದ ಮೊಳಕೆಯೊಡೆಯುವವರೆಗೆ

source: Light irrigation
hi: हल्की सिंचाई
hi_kh: हल्का पानी
kn: ಹಗುರ ನೀರಾವರಿ

source: Vegetative growth
hi: वानस्पतिक वृद्धि
hi_kh: बढ़वार समय
kn: ಸಸ್ಯಕ ಬೆಳವಣಿಗೆ

# every7to10Days
source: Every 7-10 days
hi: हर 7-10 दिनों में
hi_kh: हर 7-10 दिन पर
kn: ಪ್ರತಿ 7-10 ದಿನಗಳಿಗೊಮ್ಮೆ

# every5to7Days
source: Every 5-7 days
hi: हर 5-7 दिनों में
hi_kh: हर 5-7 दिन पर
kn: ಪ್ರತಿ 5-7 ದಿನಗಳಿಗೊಮ್ಮೆ

source: Boll development
hi: बॉल विकास
hi_kh: फल विकास
kn: ಕಾಯಿ ಬೆಳವಣಿಗೆ

source: Market information
hi: बाजार जानकारी
hi_kh: बाजार खबर
kn: ಮಾರುಕಟ್ಟೆ ಮಾಹಿತಿ

source: Current price
hi: वर्तमान कीमत
hi_kh: अभी का भाव
kn: ಪ್ರಸ್ತುತ ಬೆಲೆ

source: Market trend
hi: बाजार का रुझान
hi_kh: बाजार चाल
kn: ಮಾರುಕಟ್ಟೆ ಪ್ರವೃತ್ತಿ

source: Stable
hi: स्थिर
hi_kh: स्थिर
kn: ಸ್ಥಿರ

source: Demand
hi: मांग
hi_kh: मांग
kn: ಬೇಡಿಕೆ

source: High
hi: उच्च
hi_kh: ज्यादा
kn: ಹೆಚ್ಚು

source: Major buyers
hi: प्रमुख खरीदार
hi_kh: खरीदार
kn: ಪ್ರಮುಖ ಖರೀದಿದಾರರು

source: Textile mills, Export market
hi: कपड़ा मिलें, निर्यात बाजार
hi_kh: मिल, निर्यातक
kn: ಜವಳಿ ಗಿರಣಿಗಳು, ರಫ್ತು ಮಾರುಕಟ್ಟೆ

source: Try different inputs
hi: अलग इनपुट आज़माएं
hi_kh: दूसरा तरीका देखें
kn: ವಿಭಿನ್ನ ಇನ್‌ಪುಟ್‌ಗಳನ್ನು ಪ್ರಯತ್ನಿಸಿ

source: View market prices
hi: बाजार भाव देखें
hi_kh: भाव देखें
kn: ಮಾರುಕಟ್ಟೆ ಬೆಲೆಗಳನ್ನು ವೀಕ್ಷಿಸಿ

source: Welcome back
hi_kh: स्वागत है
kn: ಸ್ವಾಗತ

# enterPhoneToContinue
source: Enter your phone number to continue
hi_kh: मोबाइल नंबर डालें
kn: ಮುಂದುವರಿಯಲು ನಿಮ್ಮ ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ

# enterShcNumber
source: Enter Soil Health Card (SHC) number
hi_kh: माटी कार्ड (SHC) नंबर डालें
kn: ಮಣ್ಣಿನ ಆರೋಗ್ಯ ಕಾರ್ಡ್ (SHC) ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ

source: Phone
hi_kh: फोन
kn: ಫೋನ್

source: Phone number
hi_kh: मोबाइल नंबर
kn: ಫೋನ್ ಸಂಖ್ಯೆ

# enterTenDigit
source: Enter 10-digit number
hi_kh: 10 अंक का नंबर
kn: 10-ಅಂಕಿಯ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ

source: SHC Registration Number
hi_kh: SHC रजिस्ट्रेशन नंबर
kn: SHC ನೋಂದಣಿ ಸಂಖ್ಯೆ

source: Send OTP
hi_kh: OTP भेजें
kn: OTP ಕಳುಹಿಸಿ

source: Submit
hi_kh: जमा करें
kn: ಸಲ್ಲಿಸಿ

source: Personal information
hi_kh: निजी जानकारी
kn: ವೈಯಕ್ತಿಕ ಮಾಹಿತಿ

# helpUsKnowYou
source: Help us know you better
hi_kh: अपना परिचय दें
kn: ನಿಮ್ಮನ್ನು ಚೆನ್ನಾಗಿ ತಿಳಿದುಕೊಳ್ಳಲು ನಮಗೆ ಸಹಾಯ ಮಾಡಿ

source: Full name
hi_kh: पूरा नाम
kn: ಪೂರ್ಣ ಹೆಸರು

source: Village name
hi_kh: गांव का नाम
kn: ಗ್ರಾಮದ ಹೆಸರು

source: Email (Optional)
hi_kh: ईमेल (जरूरी नइखे)
kn: ಇಮೇಲ್ (ಐಚ್ಛಿಕ)

# continueText
source: Continue
hi: जारी रखें
hi_kh: आगे बढ़ें
kn: ಮುಂದುವರಿಸಿ

source: Required
hi_kh: जरूरी
kn: ಅಗತ್ಯವಿದೆ

source: Occupation
hi_kh: पेशा
kn: ಉದ್ಯೋಗ

# basedOnRegion
source: Based on soil data for {region}
hi_kh: {region} के माटी हिसाब से
kn: {region} ಗಾಗಿ ಮಣ್ಣಿನ ಡೇಟಾವನ್ನು ಆಧರಿಸಿದೆ

source: Soil properties
hi_kh: माटी गुण
kn: ಮಣ್ಣಿನ ಗುಣಲಕ್ಷಣಗಳು

source: pH Level
hi_kh: pH स्तर
kn: pH ಮಟ್ಟ

source: Moisture
hi_kh: नमी
kn: ತೇವಾಂಶ

source: Organic matter
hi_kh: जीवांश
kn: ಸಾವಯವ ವಸ್ತು

source: EC (Salinity)
hi_kh: खारापन
kn: EC (ಲವಣಾಂಶ)

source: Soil insights
hi_kh: माटी रिपोर्ट
kn: ಮಣ್ಣಿನ ಒಳನೋಟಗಳು

source: Request Soil Test
hi_kh: जांच कराएं
kn: ಮಣ್ಣು ಪರೀಕ್ಷೆಗೆ ವಿನಂತಿಸಿ

# lessThanOneAcre
source: Less than 1 acre
hi_kh: 1 एकड़ से कम
kn: 1 ಎಕರೆಗಿಂತ ಕಡಿಮೆ

# oneToTwoAcres
source: 1-2 acres
hi_kh: 1-2 एकड़
kn: 1-2 ಎಕರೆ

# twoToFiveAcres
source: 2-5 acres
hi_kh: 2-5 एकड़
kn: 2-5 ಎಕರೆ

# fiveToTenAcres
source: 5-10 acres
hi_kh: 5-10 एकड़
kn: 5-10 ಎಕರೆ

# moreThanTenAcres
source: More than 10 acres
hi_kh: 10 एकड़ से ज्यादा
kn: 10 ಎಕರೆಗಿಂತ ಹೆಚ್ಚು

source: Rainfed
hi_kh: बारिश आधारित
kn: ಮಳೆಯಾಶ್ರಿತ

source: Canal
hi_kh: नहर
kn: ಕಾಲುವೆ

source: Borewell
hi_kh: बोरवेल
kn: ಬೋರ್‌ವೆಲ್

source: Drip
hi_kh: ड्रिप
kn: ಹನಿ

source: Sandy
hi_kh: बलुई
kn: ಮರಳು

source: Loamy
hi_kh: दोमट
kn: ಮೆಕ್ಕಲು

source: Clay
hi_kh: चिकनी
kn: ಜೇಡಿಮಣ್ಣು

source: Red
hi_kh: लाल
kn: ಕೆಂಪು

source: Black
hi_kh: काली
kn: ಕಪ್ಪು

source: Fine
hi_kh: बारीक
kn: ಸೂಕ್ಷ್ಮ

source: Medium
hi_kh: मध्यम
kn: ಮಧ್ಯಮ

source: Coarse
hi_kh: मोटा
kn: ಒರಟಾದ

source: Organic manure
hi_kh: गोबर खाद
kn: ಸಾವಯವ ಗೊಬ್ಬರ

source: None
hi_kh: कुछ नहीं
kn: ಯಾವುದೂ ಇಲ್ಲ

source: Bags
hi_kh: बोरा
kn: ಚೀಲಗಳು

source: Weekly
hi_kh: हफ्ता में
kn: ವಾರಕ್ಕೊಮ್ಮೆ

source: Monthly
hi_kh: महीना में
kn: ತಿಂಗಳಿಗೊಮ್ಮೆ

source: Per stage
hi_kh: हर चरण
kn: ಪ್ರತಿ ಹಂತಕ್ಕೆ

source: Other (Manual)
hi_kh: अन्य (हाथ से)
kn: ಇತರೆ (ಹಸ್ತಚಾಲಿತ)

source: Other (Specify)
hi_kh: अन्य (बताएं)
kn: ಇತರೆ (ನಿರ್ದಿಷ್ಟಪಡಿಸಿ)

source: Rice
hi_kh: धान
kn: ಭತ್ತ

source: Sugarcane
hi_kh: गन्ना
kn: ಕಬ್ಬು

source: Soybean
hi_kh: सोयाबीन
kn: ಸೋಯಾಬೀನ್

source: Tomato
hi_kh: टमाटर
kn: ಟೊಮೆಟೊ

source: Potato
hi_kh: आलू
kn: ಆಲೂಗಡ್ಡೆ

source: Crop input
hi_kh: फसल जानकारी
kn: ಬೆಳೆ ಇನ್‌ಪುಟ್

source: Crop advisory form
hi_kh: सलाह फॉर्म
kn: ಬೆಳೆ ಸಲಹೆ ಫಾರ್ಮ್

source: Fill details
hi_kh: जानकारी भरें
kn: ವಿವರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ

# sectionFarmDetails
source: Farm details
hi_kh: खेत विवरण
kn: ಜಮೀನು ವಿವರಗಳು

source: Enter land size
hi_kh: जमीन भरें
kn: ಜಮೀನು ಗಾತ್ರವನ್ನು ನಮೂದಿಸಿ

source: Irrigation type
hi_kh: पटवन साधन
kn: ನೀರಾವರಿ ಪ್ರಕಾರ

source: Enter irrigation type
hi_kh: साधन चुनें
kn: ನೀರಾವರಿ ಪ್ರಕಾರವನ್ನು ನಮೂದಿಸಿ

# sectionSoilInfo
source: Soil info
hi_kh: माटी जानकारी
kn: ಮಣ್ಣಿನ ಮಾಹಿತಿ

source: Choose input method
hi_kh: तरीका चुनें
kn: ಇನ್‌ಪುಟ್ ವಿಧಾನವನ್ನು ಆರಿಸಿ

source: Auto-detect
hi_kh: अपने आप
kn: ಸ್ವಯಂ ಪತ್ತೆ

source: Manual
hi_kh: हाथ से
kn: ಹಸ್ತಚಾಲಿತ

source: Enter soil type
hi_kh: माटी प्रकार
kn: ಮಣ್ಣಿನ ಪ್ರಕಾರವನ್ನು ನಮೂದಿಸಿ

source: Soil texture
hi_kh: माटी बनावट
kn: ಮಣ್ಣಿನ ವಿನ್ಯಾಸ

source: Enter soil texture
hi_kh: बनावट भरें
kn: ಮಣ್ಣಿನ ವಿನ್ಯಾಸವನ್ನು ನಮೂದಿಸಿ

source: Acidic
hi_kh: अम्लीय
kn: ಆಮ್ಲೀಯ

source: Neutral
hi_kh: सामान्य
kn: ತಟಸ್ಥ

source: Alkaline
hi_kh: क्षारीय
kn: ಕ್ಷಾರೀಯ

source: Soil moisture
hi_kh: नमी
kn: ಮಣ್ಣಿನ ತೇವಾಂಶ

source: Enter moisture
hi_kh: नमी भरें
kn: ತೇವಾಂಶವನ್ನು ನಮೂದಿಸಿ

source: Upload SHC
hi_kh: कार्ड डालें
kn: SHC ಅಪ್‌ಲೋಡ್ ಮಾಡಿ

source: Recommended for accuracy
hi_kh: सटीक सलाह खातिर
kn: ನಿಖರತೆಗಾಗಿ ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ

source: SHC Number
hi_kh: SHC नंबर
kn: SHC ಸಂಖ್ಯೆ

# enterShcNumberInput
source: Enter SHC number
hi_kh: नंबर भरें
kn: SHC ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿ

source: Test date
hi_kh: जांच तारीख
kn: ಪರೀಕ್ಷಾ ದಿನಾಂಕ
